una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9260.h
/* - ----------------------------------------------------------------------------*/
/* -          ATMEL Microcontroller Software Support  -  ROUSSET  -*/
/* - ----------------------------------------------------------------------------*/
/* -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR*/
/* -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF*/
/* -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE*/
/* -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,*/
/* -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT*/
/* -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,*/
/* -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF*/
/* -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING*/
/* -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,*/
/* -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.*/
/* - ----------------------------------------------------------------------------*/
/* - File Name           : AT91SAM9260.h*/
/* - Object              : AT91SAM9260 definitions*/
/* - Generated           : AT91 SW Application Group  09/30/2005 (14:09:32)*/
/* - */
/* - CVS Reference       : /AT91SAM9260.pl/1.8/Fri Sep 30 08:12:29 2005  */
/* - CVS Reference       : /SYS_SAM9260.pl/1.1/Mon Jul 04 09:07:10 2005  */
/* - CVS Reference       : /HMATRIX1_SAM9260.pl/0/dummy timestamp  */
/* - CVS Reference       : /CCR_SAM9260.pl/0/dummy timestamp  */
/* - CVS Reference       : /PMC_SAM9260.pl/0/dummy timestamp  */
/* - CVS Reference       : /ADC_6051C.pl/1.1/Mon Jan 31 13:12:40 2005  */
/* - CVS Reference       : /HSDRAMC1_6100A.pl/1.2/Mon Aug 09 10:52:25 2004  */
/* - CVS Reference       : /HSMC3_6105A.pl/1.4/Tue Nov 16 09:16:23 2004  */
/* - CVS Reference       : /AIC_6075A.pl/1.1/Mon Jul 12 17:04:01 2004  */
/* - CVS Reference       : /PDC_6074C.pl/1.2/Thu Feb 03 09:02:11 2005  */
/* - CVS Reference       : /DBGU_6059D.pl/1.1/Mon Jan 31 13:54:41 2005  */
/* - CVS Reference       : /PIO_6057A.pl/1.2/Thu Feb 03 10:29:42 2005  */
/* - CVS Reference       : /RSTC_6098A.pl/1.3/Thu Nov 04 13:57:00 2004  */
/* - CVS Reference       : /SHDWC_6122A.pl/1.3/Wed Oct 06 14:16:58 2004  */
/* - CVS Reference       : /RTTC_6081A.pl/1.2/Thu Nov 04 13:57:22 2004  */
/* - CVS Reference       : /PITC_6079A.pl/1.2/Thu Nov 04 13:56:22 2004  */
/* - CVS Reference       : /WDTC_6080A.pl/1.3/Thu Nov 04 13:58:52 2004  */
/* - CVS Reference       : /TC_6082A.pl/1.7/Wed Mar 09 16:31:51 2005  */
/* - CVS Reference       : /MCI_6101E.pl/1.1/Fri Jun 03 13:20:23 2005  */
/* - CVS Reference       : /TWI_6061A.pl/1.1/Tue Jul 13 06:38:23 2004  */
/* - CVS Reference       : /US_6089C.pl/1.1/Mon Jan 31 13:56:02 2005  */
/* - CVS Reference       : /SSC_6078A.pl/1.1/Tue Jul 13 07:10:41 2004  */
/* - CVS Reference       : /SPI_6088D.pl/1.3/Fri May 20 14:23:02 2005  */
/* - CVS Reference       : /EMACB_6119A.pl/1.6/Wed Jul 13 15:25:00 2005  */
/* - CVS Reference       : /UDP_6083C.pl/1.2/Tue May 10 12:40:17 2005  */
/* - CVS Reference       : /UHP_6127A.pl/1.1/Wed Feb 23 16:03:17 2005  */
/* - CVS Reference       : /TBOX_XXXX.pl/1.15/Thu Jun 09 07:05:57 2005  */
/* - CVS Reference       : /EBI_SAM9260.pl/0/dummy timestamp  */
/* - CVS Reference       : /HECC_6143A.pl/1.1/Wed Feb 09 17:16:57 2005  */
/* - CVS Reference       : /ISI_xxxxx.pl/1.3/Thu Mar 03 11:11:48 2005  */
/* - ----------------------------------------------------------------------------*/

#ifndef AT91SAM9260_H
#define AT91SAM9260_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;/* Hardware register definition*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* ******************************************************************************/
typedef struct _AT91S_SYS {
	AT91_REG	 SDRAMC_MR; 	/* SDRAM Controller Mode Register*/
	AT91_REG	 SDRAMC_TR; 	/* SDRAM Controller Refresh Timer Register*/
	AT91_REG	 SDRAMC_CR; 	/* SDRAM Controller Configuration Register*/
	AT91_REG	 SDRAMC_HSR; 	/* SDRAM Controller High Speed Register*/
	AT91_REG	 SDRAMC_LPR; 	/* SDRAM Controller Low Power Register*/
	AT91_REG	 SDRAMC_IER; 	/* SDRAM Controller Interrupt Enable Register*/
	AT91_REG	 SDRAMC_IDR; 	/* SDRAM Controller Interrupt Disable Register*/
	AT91_REG	 SDRAMC_IMR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SDRAMC_ISR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SDRAMC_MDR; 	/* SDRAM Memory Device Register*/
	AT91_REG	 Reserved0[118]; 	/* */
	AT91_REG	 SMC_SETUP0; 	/*  Setup Register for CS 0*/
	AT91_REG	 SMC_PULSE0; 	/*  Pulse Register for CS 0*/
	AT91_REG	 SMC_CYCLE0; 	/*  Cycle Register for CS 0*/
	AT91_REG	 SMC_CTRL0; 	/*  Control Register for CS 0*/
	AT91_REG	 SMC_SETUP1; 	/*  Setup Register for CS 1*/
	AT91_REG	 SMC_PULSE1; 	/*  Pulse Register for CS 1*/
	AT91_REG	 SMC_CYCLE1; 	/*  Cycle Register for CS 1*/
	AT91_REG	 SMC_CTRL1; 	/*  Control Register for CS 1*/
	AT91_REG	 SMC_SETUP2; 	/*  Setup Register for CS 2*/
	AT91_REG	 SMC_PULSE2; 	/*  Pulse Register for CS 2*/
	AT91_REG	 SMC_CYCLE2; 	/*  Cycle Register for CS 2*/
	AT91_REG	 SMC_CTRL2; 	/*  Control Register for CS 2*/
	AT91_REG	 SMC_SETUP3; 	/*  Setup Register for CS 3*/
	AT91_REG	 SMC_PULSE3; 	/*  Pulse Register for CS 3*/
	AT91_REG	 SMC_CYCLE3; 	/*  Cycle Register for CS 3*/
	AT91_REG	 SMC_CTRL3; 	/*  Control Register for CS 3*/
	AT91_REG	 SMC_SETUP4; 	/*  Setup Register for CS 4*/
	AT91_REG	 SMC_PULSE4; 	/*  Pulse Register for CS 4*/
	AT91_REG	 SMC_CYCLE4; 	/*  Cycle Register for CS 4*/
	AT91_REG	 SMC_CTRL4; 	/*  Control Register for CS 4*/
	AT91_REG	 SMC_SETUP5; 	/*  Setup Register for CS 5*/
	AT91_REG	 SMC_PULSE5; 	/*  Pulse Register for CS 5*/
	AT91_REG	 SMC_CYCLE5; 	/*  Cycle Register for CS 5*/
	AT91_REG	 SMC_CTRL5; 	/*  Control Register for CS 5*/
	AT91_REG	 SMC_SETUP6; 	/*  Setup Register for CS 6*/
	AT91_REG	 SMC_PULSE6; 	/*  Pulse Register for CS 6*/
	AT91_REG	 SMC_CYCLE6; 	/*  Cycle Register for CS 6*/
	AT91_REG	 SMC_CTRL6; 	/*  Control Register for CS 6*/
	AT91_REG	 SMC_SETUP7; 	/*  Setup Register for CS 7*/
	AT91_REG	 SMC_PULSE7; 	/*  Pulse Register for CS 7*/
	AT91_REG	 SMC_CYCLE7; 	/*  Cycle Register for CS 7*/
	AT91_REG	 SMC_CTRL7; 	/*  Control Register for CS 7*/
	AT91_REG	 Reserved1[96]; 	/* */
	AT91_REG	 MATRIX_MCFG0; 	/*  Master Configuration Register 0 (ram96k)     */
	AT91_REG	 MATRIX_MCFG1; 	/*  Master Configuration Register 1 (rom)    */
	AT91_REG	 MATRIX_MCFG2; 	/*  Master Configuration Register 2 (hperiphs) */
	AT91_REG	 MATRIX_MCFG3; 	/*  Master Configuration Register 3 (ebi)*/
	AT91_REG	 MATRIX_MCFG4; 	/*  Master Configuration Register 4 (bridge)    */
	AT91_REG	 MATRIX_MCFG5; 	/*  Master Configuration Register 5 (mailbox)    */
	AT91_REG	 Reserved2[10]; 	/* */
	AT91_REG	 MATRIX_SCFG0; 	/*  Slave Configuration Register 0 (ram96k)     */
	AT91_REG	 MATRIX_SCFG1; 	/*  Slave Configuration Register 1 (rom)    */
	AT91_REG	 MATRIX_SCFG2; 	/*  Slave Configuration Register 2 (hperiphs) */
	AT91_REG	 MATRIX_SCFG3; 	/*  Slave Configuration Register 3 (ebi)*/
	AT91_REG	 MATRIX_SCFG4; 	/*  Slave Configuration Register 4 (bridge)    */
	AT91_REG	 Reserved3[11]; 	/* */
	AT91_REG	 MATRIX_PRAS0; 	/*  PRAS0 (ram0) */
	AT91_REG	 Reserved4[1]; 	/* */
	AT91_REG	 MATRIX_PRAS1; 	/*  PRAS1 (ram1) */
	AT91_REG	 Reserved5[1]; 	/* */
	AT91_REG	 MATRIX_PRAS2; 	/*  PRAS2 (ram2) */
	AT91_REG	 Reserved6[1]; 	/* */
	AT91_REG	 MATRIX_PRAS3; 	/*  PRAS3 (ebi) */
	AT91_REG	 Reserved7[1]; 	/* */
	AT91_REG	 MATRIX_PRAS4; 	/*  PRAS4 (periph) */
	AT91_REG	 Reserved8[23]; 	/* */
	AT91_REG	 MATRIX_MRCR; 	/*  Master Remp Control Register */
	AT91_REG	 Reserved9[6]; 	/* */
	AT91_REG	 CCFG_EBICSA; 	/*  EBI Chip Select Assignement Register*/
	AT91_REG	 Reserved10[55]; 	/* */
	AT91_REG	 CCFG_MATRIXVERSION; 	/*  Version Register*/
	AT91_REG	 AIC_SMR[32]; 	/* Source Mode Register*/
	AT91_REG	 AIC_SVR[32]; 	/* Source Vector Register*/
	AT91_REG	 AIC_IVR; 	/* IRQ Vector Register*/
	AT91_REG	 AIC_FVR; 	/* FIQ Vector Register*/
	AT91_REG	 AIC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 AIC_IPR; 	/* Interrupt Pending Register*/
	AT91_REG	 AIC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 AIC_CISR; 	/* Core Interrupt Status Register*/
	AT91_REG	 Reserved11[2]; 	/* */
	AT91_REG	 AIC_IECR; 	/* Interrupt Enable Command Register*/
	AT91_REG	 AIC_IDCR; 	/* Interrupt Disable Command Register*/
	AT91_REG	 AIC_ICCR; 	/* Interrupt Clear Command Register*/
	AT91_REG	 AIC_ISCR; 	/* Interrupt Set Command Register*/
	AT91_REG	 AIC_EOICR; 	/* End of Interrupt Command Register*/
	AT91_REG	 AIC_SPU; 	/* Spurious Vector Register*/
	AT91_REG	 AIC_DCR; 	/* Debug Control Register (Protect)*/
	AT91_REG	 Reserved12[1]; 	/* */
	AT91_REG	 AIC_FFER; 	/* Fast Forcing Enable Register*/
	AT91_REG	 AIC_FFDR; 	/* Fast Forcing Disable Register*/
	AT91_REG	 AIC_FFSR; 	/* Fast Forcing Status Register*/
	AT91_REG	 Reserved13[45]; 	/* */
	AT91_REG	 DBGU_CR; 	/* Control Register*/
	AT91_REG	 DBGU_MR; 	/* Mode Register*/
	AT91_REG	 DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved14[7]; 	/* */
	AT91_REG	 DBGU_CIDR; 	/* Chip ID Register*/
	AT91_REG	 DBGU_EXID; 	/* Chip ID Extension Register*/
	AT91_REG	 DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved15[45]; 	/* */
	AT91_REG	 DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 DBGU_PTSR; 	/* PDC Transfer Status Register*/
	AT91_REG	 Reserved16[54]; 	/* */
	AT91_REG	 PIOA_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOA_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOA_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved17[1]; 	/* */
	AT91_REG	 PIOA_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOA_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOA_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved18[1]; 	/* */
	AT91_REG	 PIOA_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOA_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOA_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved19[1]; 	/* */
	AT91_REG	 PIOA_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOA_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOA_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOA_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOA_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOA_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOA_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOA_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOA_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOA_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOA_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved20[1]; 	/* */
	AT91_REG	 PIOA_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOA_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOA_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved21[1]; 	/* */
	AT91_REG	 PIOA_ASR; 	/* Select A Register*/
	AT91_REG	 PIOA_BSR; 	/* Select B Register*/
	AT91_REG	 PIOA_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved22[9]; 	/* */
	AT91_REG	 PIOA_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOA_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOA_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved23[85]; 	/* */
	AT91_REG	 PIOB_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOB_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOB_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved24[1]; 	/* */
	AT91_REG	 PIOB_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOB_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOB_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved25[1]; 	/* */
	AT91_REG	 PIOB_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOB_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOB_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved26[1]; 	/* */
	AT91_REG	 PIOB_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOB_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOB_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOB_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOB_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOB_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOB_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOB_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOB_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOB_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOB_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved27[1]; 	/* */
	AT91_REG	 PIOB_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOB_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOB_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved28[1]; 	/* */
	AT91_REG	 PIOB_ASR; 	/* Select A Register*/
	AT91_REG	 PIOB_BSR; 	/* Select B Register*/
	AT91_REG	 PIOB_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved29[9]; 	/* */
	AT91_REG	 PIOB_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOB_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOB_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved30[85]; 	/* */
	AT91_REG	 PIOC_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOC_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOC_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved31[1]; 	/* */
	AT91_REG	 PIOC_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOC_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOC_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved32[1]; 	/* */
	AT91_REG	 PIOC_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOC_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOC_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved33[1]; 	/* */
	AT91_REG	 PIOC_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOC_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOC_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOC_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOC_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOC_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOC_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved34[1]; 	/* */
	AT91_REG	 PIOC_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOC_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOC_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved35[1]; 	/* */
	AT91_REG	 PIOC_ASR; 	/* Select A Register*/
	AT91_REG	 PIOC_BSR; 	/* Select B Register*/
	AT91_REG	 PIOC_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved36[9]; 	/* */
	AT91_REG	 PIOC_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOC_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOC_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved37[213]; 	/* */
	AT91_REG	 PMC_SCER; 	/* System Clock Enable Register*/
	AT91_REG	 PMC_SCDR; 	/* System Clock Disable Register*/
	AT91_REG	 PMC_SCSR; 	/* System Clock Status Register*/
	AT91_REG	 Reserved38[1]; 	/* */
	AT91_REG	 PMC_PCER; 	/* Peripheral Clock Enable Register*/
	AT91_REG	 PMC_PCDR; 	/* Peripheral Clock Disable Register*/
	AT91_REG	 PMC_PCSR; 	/* Peripheral Clock Status Register*/
	AT91_REG	 Reserved39[1]; 	/* */
	AT91_REG	 PMC_MOR; 	/* Main Oscillator Register*/
	AT91_REG	 PMC_MCFR; 	/* Main Clock  Frequency Register*/
	AT91_REG	 PMC_PLLAR; 	/* PLL A Register*/
	AT91_REG	 PMC_PLLBR; 	/* PLL B Register*/
	AT91_REG	 PMC_MCKR; 	/* Master Clock Register*/
	AT91_REG	 Reserved40[3]; 	/* */
	AT91_REG	 PMC_PCKR[8]; 	/* Programmable Clock Register*/
	AT91_REG	 PMC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PMC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PMC_SR; 	/* Status Register*/
	AT91_REG	 PMC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved41[36]; 	/* */
	AT91_REG	 RSTC_RCR; 	/* Reset Control Register*/
	AT91_REG	 RSTC_RSR; 	/* Reset Status Register*/
	AT91_REG	 RSTC_RMR; 	/* Reset Mode Register*/
	AT91_REG	 Reserved42[1]; 	/* */
	AT91_REG	 SHDWC_SHCR; 	/* Shut Down Control Register*/
	AT91_REG	 SHDWC_SHMR; 	/* Shut Down Mode Register*/
	AT91_REG	 SHDWC_SHSR; 	/* Shut Down Status Register*/
	AT91_REG	 Reserved43[1]; 	/* */
	AT91_REG	 RTTC_RTMR; 	/* Real-time Mode Register*/
	AT91_REG	 RTTC_RTAR; 	/* Real-time Alarm Register*/
	AT91_REG	 RTTC_RTVR; 	/* Real-time Value Register*/
	AT91_REG	 RTTC_RTSR; 	/* Real-time Status Register*/
	AT91_REG	 PITC_PIMR; 	/* Period Interval Mode Register*/
	AT91_REG	 PITC_PISR; 	/* Period Interval Status Register*/
	AT91_REG	 PITC_PIVR; 	/* Period Interval Value Register*/
	AT91_REG	 PITC_PIIR; 	/* Period Interval Image Register*/
	AT91_REG	 WDTC_WDCR; 	/* Watchdog Control Register*/
	AT91_REG	 WDTC_WDMR; 	/* Watchdog Mode Register*/
	AT91_REG	 WDTC_WDSR; 	/* Watchdog Status Register*/
	AT91_REG	 Reserved44[1]; 	/* */
	AT91_REG	 SYS_GPBR0; 	/* General Purpose Register 0*/
	AT91_REG	 SYS_GPBR1; 	/* General Purpose Register 1*/
	AT91_REG	 SYS_GPBR2; 	/* General Purpose Register 2*/
	AT91_REG	 SYS_GPBR3; 	/* General Purpose Register 3*/
} AT91S_SYS, *AT91PS_SYS;

